Tekla Open API Reference for Tekla Structures 2025
Polygon.Attributes Property
 The attributes for the polygon.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polygon.PolygonAttributes Attributes { get; set; }
Public Property Attributes As Polygon.PolygonAttributes
	Get
	Set
Property Value
Type: Polygon.PolygonAttributes
See Also
Reference
Polygon Class
Tekla.Structures.Drawing Namespace